(αζ1,αζ2,αζ3,αζ4,αζ5,ω)
Prgm
If ok=7 Then
Return 
EndIf
left(αζ1,1)→αζ11
If αζ11="z" Then
expr("((("&αζ1&"22)*(v"&αζ2&")-("&αζ1&"12)*(v"&αζ3&"))/(("&αζ1&"11)*("&αζ1&"22)-("&αζ1&"12)*("&αζ1&"21)))→i"&αζ1&αζ2)
expr("((("&αζ1&"11)*(v"&αζ3&")-("&αζ1&"21)*(v"&αζ2&"))/(("&αζ1&"11)*("&αζ1&"22)-("&αζ1&"12)*("&αζ1&"21)))→i"&αζ1&αζ3)
αuk2&"i"&αζ1&αζ2&","→αuk2
αuk2&"i"&αζ1&αζ3&","→αuk2
If αζ2≠"0" and expr("getType(Γζ"&αζ2&")")="NONE" Then
expr("0→βζ"&αζ2)
αeql&"Γζ"&αζ2&" and "→αeql
αdl&"Γζ"&αζ2&","→αdl
αdl&"βζ"&αζ2&","→αdl
EndIf
expr("βζ"&αζ2&"+i"&αζ1&αζ2&"→βζ"&αζ2)
expr("βζ"&αζ2&"=0→Γζ"&αζ2)
If αζ3≠"0" and expr("getType(Γζ"&αζ3&")")="NONE" Then
expr("0→βζ"&αζ3)
αeql&"Γζ"&αζ3&" and "→αeql
αdl&"Γζ"&αζ3&","→αdl
αdl&"βζ"&αζ3&","→αdl
EndIf
expr("βζ"&αζ3&"+i"&αζ1&αζ3&"→βζ"&αζ3)
expr("βζ"&αζ3&"=0→Γζ"&αζ3)
If αζ2≠"0" and instring(αuk1,"v"&αζ2)=0 Then
αuk1&"v"&αζ2&","→αuk1
EndIf
If αζ3≠"0" and instring(αuk1,"v"&αζ3)=0 Then
αuk1&"v"&αζ3&","→αuk1
EndIf
EndIf
If αζ11="y" Then
expr("(("&αζ1&"11)*(v"&αζ2&")+("&αζ1&"12)*(v"&αζ3&"))→i"&αζ1&αζ2)
expr("(("&αζ1&"21)*(v"&αζ2&")+("&αζ1&"22)*(v"&αζ3&"))→i"&αζ1&αζ3)
αuk2&"i"&αζ1&αζ2&","→αuk2
αuk2&"i"&αζ1&αζ3&","→αuk2
If αζ2≠"0" and expr("getType(Γζ"&αζ2&")")="NONE" Then
expr("0→βζ"&αζ2)
αeql&"Γζ"&αζ2&" and "→αeql
αdl&"Γζ"&αζ2&","→αdl
αdl&"βζ"&αζ2&","→αdl
EndIf
expr("βζ"&αζ2&"+i"&αζ1&αζ2&"→βζ"&αζ2)
expr("βζ"&αζ2&"=0→Γζ"&αζ2)
If αζ3≠"0" and expr("getType(Γζ"&αζ3&")")="NONE" Then
expr("0→βζ"&αζ3)
αeql&"Γζ"&αζ3&" and "→αeql
αdl&"Γζ"&αζ3&","→αdl
αdl&"βζ"&αζ3&","→αdl
EndIf
expr("βζ"&αζ3&"+i"&αζ1&αζ3&"→βζ"&αζ3)
expr("βζ"&αζ3&"=0→Γζ"&αζ3)
If αζ2≠"0" and instring(αuk1,"v"&αζ2)=0 Then
αuk1&"v"&αζ2&","→αuk1
EndIf
If αζ3≠"0" and instring(αuk1,"v"&αζ3)=0 Then
αuk1&"v"&αζ3&","→αuk1
EndIf
EndIf
If αζ11="h" Then
expr("(((v"&αζ2&")-("&αζ1&"12)*(v"&αζ3&"))/("&αζ1&"11))→i"&αζ1&αζ2)
expr("(("&αζ1&"22)*(v"&αζ3&")-("&αζ1&"21)*(("&αζ1&"12)*(v"&αζ3&")-(v"&αζ2&"))/("&αζ1&"11))→i"&αζ1&αζ3)
αuk2&"i"&αζ1&αζ2&","→αuk2
αuk2&"i"&αζ1&αζ3&","→αuk2
If αζ2≠"0" and expr("getType(Γζ"&αζ2&")")="NONE" Then
expr("0→βζ"&αζ2)
αeql&"Γζ"&αζ2&" and "→αeql
αdl&"Γζ"&αζ2&","→αdl
αdl&"βζ"&αζ2&","→αdl
EndIf
expr("βζ"&αζ2&"+i"&αζ1&αζ2&"→βζ"&αζ2)
expr("βζ"&αζ2&"=0→Γζ"&αζ2)
If αζ3≠"0" and expr("getType(Γζ"&αζ3&")")="NONE" Then
expr("0→βζ"&αζ3)
αeql&"Γζ"&αζ3&" and "→αeql
αdl&"Γζ"&αζ3&","→αdl
αdl&"βζ"&αζ3&","→αdl
EndIf
expr("βζ"&αζ3&"+i"&αζ1&αζ3&"→βζ"&αζ3)
expr("βζ"&αζ3&"=0→Γζ"&αζ3)
If αζ2≠"0" and instring(αuk1,"v"&αζ2)=0 Then
αuk1&"v"&αζ2&","→αuk1
EndIf
If αζ3≠"0" and instring(αuk1,"v"&αζ3)=0 Then
αuk1&"v"&αζ3&","→αuk1
EndIf
EndIf
If αζ11="g" Then
expr("(((("&αζ1&"11)*("&αζ1&"22)-("&αζ1&"12)*("&αζ1&"21))/("&αζ1&"22))*(v"&αζ2&")+(("&αζ1&"12)/("&αζ1&"22))*(v"&αζ3&"))→i"&αζ1&αζ2)
expr("((–("&αζ1&"21)/("&αζ1&"22))*(v"&αζ2&")+(1/("&αζ1&"22))*(v"&αζ3&"))→i"&αζ1&αζ3)
αuk2&"i"&αζ1&αζ2&","→αuk2
αuk2&"i"&αζ1&αζ3&","→αuk2
If αζ2≠"0" and expr("getType(Γζ"&αζ2&")")="NONE" Then
expr("0→βζ"&αζ2)
αeql&"Γζ"&αζ2&" and "→αeql
αdl&"Γζ"&αζ2&","→αdl
αdl&"βζ"&αζ2&","→αdl
EndIf
expr("βζ"&αζ2&"+i"&αζ1&αζ2&"→βζ"&αζ2)
expr("βζ"&αζ2&"=0→Γζ"&αζ2)
If αζ3≠"0" and expr("getType(Γζ"&αζ3&")")="NONE" Then
expr("0→βζ"&αζ3)
αeql&"Γζ"&αζ3&" and "→αeql
αdl&"Γζ"&αζ3&","→αdl
αdl&"βζ"&αζ3&","→αdl
EndIf
expr("βζ"&αζ3&"+i"&αζ1&αζ3&"→βζ"&αζ3)
expr("βζ"&αζ3&"=0→Γζ"&αζ3)
If αζ2≠"0" and instring(αuk1,"v"&αζ2)=0 Then
αuk1&"v"&αζ2&","→αuk1
EndIf
If αζ3≠"0" and instring(αuk1,"v"&αζ3)=0 Then
αuk1&"v"&αζ3&","→αuk1
EndIf
EndIf
If αζ11="a" Then
expr("(–("&αζ1&"11)*("&αζ1&"22)*(v"&αζ3&")+("&αζ1&"12)*("&αζ1&"21)*(v"&αζ3&")+("&αζ1&"22)*(v"&αζ2&"))/("&αζ1&"12)→i"&αζ1&αζ2)
expr("(("&αζ1&"11)*(v"&αζ3&")-(v"&αζ2&"))/("&αζ1&"12)→i"&αζ1&αζ3)
αuk2&"i"&αζ1&αζ2&","→αuk2
αuk2&"i"&αζ1&αζ3&","→αuk2
If αζ2≠"0" and expr("getType(Γζ"&αζ2&")")="NONE" Then
expr("0→βζ"&αζ2)
αeql&"Γζ"&αζ2&" and "→αeql
αdl&"Γζ"&αζ2&","→αdl
αdl&"βζ"&αζ2&","→αdl
EndIf
expr("βζ"&αζ2&"+i"&αζ1&αζ2&"→βζ"&αζ2)
expr("βζ"&αζ2&"=0→Γζ"&αζ2)
If αζ3≠"0" and expr("getType(Γζ"&αζ3&")")="NONE" Then
expr("0→βζ"&αζ3)
αeql&"Γζ"&αζ3&" and "→αeql
αdl&"Γζ"&αζ3&","→αdl
αdl&"βζ"&αζ3&","→αdl
EndIf
expr("βζ"&αζ3&"+i"&αζ1&αζ3&"→βζ"&αζ3)
expr("βζ"&αζ3&"=0→Γζ"&αζ3)
If αζ2≠"0" and instring(αuk1,"v"&αζ2)=0 Then
αuk1&"v"&αζ2&","→αuk1
EndIf
If αζ3≠"0" and instring(αuk1,"v"&αζ3)=0 Then
αuk1&"v"&αζ3&","→αuk1
EndIf
EndIf
If αζ11="b" Then
expr("((("&αζ1&"11)/("&αζ1&"12))*(v"&αζ2&")+(–1/("&αζ1&"12))*(v"&αζ3&"))→i"&αζ1&αζ2)
expr("((–(("&αζ1&"11)*("&αζ1&"22)-("&αζ1&"12)*("&αζ1&"21))/("&αζ1&"12))*(v"&αζ2&")+(("&αζ1&"22)/("&αζ1&"12))*(v"&αζ3&"))→i"&αζ1&αζ3)
αuk2&"i"&αζ1&αζ2&","→αuk2
αuk2&"i"&αζ1&αζ3&","→αuk2
If αζ2≠"0" and expr("getType(Γζ"&αζ2&")")="NONE" Then
expr("0→βζ"&αζ2)
αeql&"Γζ"&αζ2&" and "→αeql
αdl&"Γζ"&αζ2&","→αdl
αdl&"βζ"&αζ2&","→αdl
EndIf
expr("βζ"&αζ2&"+i"&αζ1&αζ2&"→βζ"&αζ2)
expr("βζ"&αζ2&"=0→Γζ"&αζ2)
If αζ3≠"0" and expr("getType(Γζ"&αζ3&")")="NONE" Then
expr("0→βζ"&αζ3)
αeql&"Γζ"&αζ3&" and "→αeql
αdl&"Γζ"&αζ3&","→αdl
αdl&"βζ"&αζ3&","→αdl
EndIf
expr("βζ"&αζ3&"+i"&αζ1&αζ3&"→βζ"&αζ3)
expr("βζ"&αζ3&"=0→Γζ"&αζ3)
If αζ2≠"0" and instring(αuk1,"v"&αζ2)=0 Then
αuk1&"v"&αζ2&","→αuk1
EndIf
If αζ3≠"0" and instring(αuk1,"v"&αζ3)=0 Then
αuk1&"v"&αζ3&","→αuk1
EndIf
EndIf
DelVar αζ11
EndPrgm
